{
  "title": "Tech Setup 2025",
  "brief": "My current tech stack and workspace setup",
  "cover": "https://i.imgur.com/zT1t88E.png",
  "images": [
    "https://i.imgur.com/AdUP6pD.png",
    "https://i.imgur.com/L5n4x1b.png"
  ],
  "content": "A detailed look at my current tech setup, including my main workstation, development environment, and the tools I use daily. This post will be broken down into several sections to cover everything from the hardware on my desk to the software I use to code, write, and create.\n\nThe heart of my setup is a custom-built PC. I've always preferred building my own machines to get the exact performance and aesthetics I want. The current iteration features a Ryzen 9 CPU, 64GB of RAM, and an NVIDIA RTX series GPU. This provides more than enough power for my development work, which includes running multiple virtual machines and containers, as well as for my hobbies like 3D modeling and gaming.\n\nMy monitor setup is crucial for productivity. I use a dual-monitor configuration with one ultra-wide display in the center for my primary workspace (code editors, terminals) and a secondary 16:9 monitor in portrait orientation to the side. The portrait monitor is fantastic for reading documentation, browsing long articles, or keeping an eye on Slack and email without constant window switching.\n\nFor peripherals, I've settled on a mechanical keyboard with tactile switches. The feedback is great for typing, and I find it less fatiguing over long sessions. My mouse is a high-precision ergonomic model, which is a must-have to prevent wrist strain. A good chair and a desk at the right height are non-negotiable investments for anyone who spends a lot of time at a computer.\n\nOn the software side, my primary operating system is a Linux distribution, specifically Arch Linux. I appreciate its minimalist philosophy and the control it gives me over my environment. My code editor of choice is Visual Studio Code, with a heavily customized set of extensions for Python, JavaScript, Rust, and Go. I live in the terminal, using tools like zsh, tmux, and neovim for quick edits and system management.\n\nThis entire setup is the result of years of iteration and refinement. It's tailored to my specific workflow, but I hope sharing it gives you some ideas for optimizing your own workspace. A comfortable and efficient environment can make a world of difference in your productivity and overall enjoyment of your work.",
  "tags": ["technology", "setup", "workspace"]
} 